Обработки/Reports/_РасшифровкаСтоимостиАктивовДляГруппыБудущего.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасшифровкаСтоимостиАктивовДляГруппыБудущего</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиенты</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезУчетаРасчетаПоПисьмуЦБ0185316</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасшифровкаСтоимостиАктивовДляГруппыБудущего/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область События_формы_и_элементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	// Параметры по умолчанию

	Отчет.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.Период		= Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата()) - 1);
	
	Отчет.Клиенты.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица");
	
	Отчет.Клиенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Большой"));		// АО МНПФ БОЛЬШОЙ
	Отчет.Клиенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Будущее"));		// НПФ БУДУЩЕЕ АО
	Отчет.Клиенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ТелекомСоюз"));	// НПФ Телеком-Союз АО
	Отчет.Клиенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Эволюция"));		// НПФ Эволюция АО
	Отчет.Клиенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Сафмар"));			// НПФ ДОСТОЙНОЕ БУДУЩЕЕ
	Отчет.Клиенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_УГМК"));				// УГМК-Перспектива НПФ АО
	Отчет.Клиенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_НПФОПФ"));			// НПФ ОПФ АО
	Отчет.Клиенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Федерация"));		// НПФ ФЕДЕРАЦИЯ АО
	Отчет.Клиенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_Традиция"));			// НПФ ТРАДИЦИЯ АО
	
	// Доступность реквизитов и команд в зависимости от прав
	
	ЭтоПолноправныйПользователь = РаботаСПользователями.ЭтоПолноправныйПользователь();
	
	Элементы.Организация.Видимость			= ЭтоПолноправныйПользователь;
	Элементы.ОрганизацияНадпись.Видимость	= Не ЭтоПолноправныйПользователь;
	Элементы.КомандаОтладкаКоманд.Видимость	= ЭтоПолноправныйПользователь;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ПриИзмененииРеквизитовОтчета(Элементы.Организация);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитовОтчета(Элемент)

	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ДокументРезультат, "НЕАКТУАЛЬНОСТЬ");
		
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	СчетаДУБезДатЗапрета = Неопределено;
	СчетаДУБезСЧА		 = Неопределено; 
	
	Если Не СформироватьОтчет(Истина, , СчетаДУБезДатЗапрета, СчетаДУБезСЧА) Тогда

		ТекстВопроса = "Некоторые счета доверительного управления не будут выведены в отчет.";	
		
		Если ЗначениеЗаполнено(СчетаДУБезДатЗапрета) Тогда
			ТекстВопроса = ТекстВопроса + Символы.ПС + "Не установлены даты запрета редактирования: "
				+ ?(СчетаДУБезДатЗапрета.Количество() <= 2, СтрСоединить(СчетаДУБезДатЗапрета, ", "), СтрШаблон("%1, %2 и еще %3", СчетаДУБезДатЗапрета[0], СчетаДУБезДатЗапрета[1], СчетаДУБезДатЗапрета.Количество()));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СчетаДУБезСЧА) Тогда
			ТекстВопроса = ТекстВопроса + Символы.ПС + "Не зарегистрирована СЧА: "
				+ ?(СчетаДУБезСЧА.Количество() <= 2, СтрСоединить(СчетаДУБезСЧА, ", "), СтрШаблон("%1, %2 и еще %3", СчетаДУБезСЧА[0], СчетаДУБезСЧА[1], СчетаДУБезСЧА.Количество()));
		КонецЕсли;
		
		ТекстВопроса = ТекстВопроса + Символы.ПС + "Продолжить формирование?";
		
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
			ИсключаемыеСчета = Новый Массив;
			
			Если ЗначениеЗаполнено(СчетаДУБезДатЗапрета) Тогда
				РаботаСКоллекциями.ДополнитьМассив(ИсключаемыеСчета, СчетаДУБезДатЗапрета, Истина);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СчетаДУБезСЧА) Тогда
				РаботаСКоллекциями.ДополнитьМассив(ИсключаемыеСчета, СчетаДУБезСЧА, Истина);
			КонецЕсли;
			
			СформироватьОтчет(Ложь, ИсключаемыеСчета);	
			
		Иначе
			
			Если ЗначениеЗаполнено(СчетаДУБезДатЗапрета) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(
					"Не установлены даты запрета редактирования:
					|	%1", СтрСоединить(СчетаДУБезДатЗапрета, Символы.ПС + Символы.Таб)));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СчетаДУБезСЧА) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(
					"Не зарегистрирована СЧА:
					|	%1", СтрСоединить(СчетаДУБезСЧА, Символы.ПС + Символы.Таб)));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчет(ПроверитьГотовностьДанных, ИсключаемыеСчетаДУ = Неопределено, СчетаДУБезДатЗапрета = Неопределено, СчетаДУБезСЧА = Неопределено)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	ОтчетОбъект.ДополнительныеСвойства.Вставить("ИсключаемыеСчетаДоверительногоУправления", ИсключаемыеСчетаДУ);
	
	Если ПроверитьГотовностьДанных
		И Не ОтчетОбъект.ПроверитьГотовностьДанных(, , СчетаДУБезДатЗапрета, СчетаДУБезСЧА)
	Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ДокументРезультат, "НЕАКТУАЛЬНОСТЬ");
	
	ЭтаФорма.ДокументРезультат.Очистить();
	
	ОтчетОбъект.ДополнительныеСвойства.Вставить("ПропуститьПредварительнуюПроверкуГотовностиДанных");
	
	ОтчетОбъект.СкомпоноватьРезультат(ЭтаФорма.ДокументРезультат);
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ДокументРезультат);	
	
	Возврат Истина;
	
КонецФункции

#Область Отладка_команд_дополнительного_отчета_и_обработки

&НаКлиенте
Процедура ВыбратьИВыполнитьКоманду(Команда)
	
	ИмяТипаОбъекта = ИмяТипаОсновногоРеквизитаФормы(ЭтаФорма);
	
	СписокКоманд = ПолучитьСписокКомандНаСервере(ИмяТипаОбъекта);
	
	Если СписокКоманд.Количество() > 0 Тогда
	
		ВыбраннаяКоманда = СписокКоманд.ВыбратьЭлемент("Выполнить команду");
		
		Если Не ВыбраннаяКоманда = Неопределено Тогда
			ВыполнитьКомандуНаСервере(ИмяТипаОбъекта, ВыбраннаяКоманда.Значение);
		КонецЕсли; 	
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В справочнике ""Дополнительные отчеты и обработки"" для данного объекта команды не заданы");
	
	КонецЕсли;	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокКомандНаСервере(ИмяТипаОбъекта)

	ОбработкаНаСервере = Новый(ИмяТипаОбъекта);	
	
	СписокКоманд = Новый СписокЗначений;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеОтчетыИОбработкиКоманды.НомерСтроки КАК НомерСтроки,
		|	ДополнительныеОтчетыИОбработкиКоманды.Представление КАК Представление,
		|	ДополнительныеОтчетыИОбработкиГруппыПараметров.Имя КАК Имя
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки.ГруппыПараметров КАК ДополнительныеОтчетыИОбработкиГруппыПараметров
		|			ПО ДополнительныеОтчетыИОбработкиКоманды.Ссылка = ДополнительныеОтчетыИОбработкиГруппыПараметров.Ссылка
		|				И ДополнительныеОтчетыИОбработкиКоманды.ГруппаПараметров = ДополнительныеОтчетыИОбработкиГруппыПараметров.Идентификатор
		|		ПО ДополнительныеОтчетыИОбработки.Ссылка = ДополнительныеОтчетыИОбработкиКоманды.Ссылка
		|ГДЕ
		|	ДополнительныеОтчетыИОбработки.ИмяОбъекта = &ИмяОбъекта");
	
	Запрос.УстановитьПараметр("ИмяОбъекта", ОбработкаНаСервере.Метаданные().Имя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден элемент справочника ""Дополнительные отчеты и обработки""");
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Представление) Тогда
				Представление = Выборка.Представление + " (" + Выборка.Имя + ")";
				СписокКоманд.Добавить(Выборка.НомерСтроки, Представление);
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат СписокКоманд;
	
КонецФункции
 
&НаСервереБезКонтекста
Процедура ВыполнитьКомандуНаСервере(ИмяТипаОбъекта, НомерСтроки)

	ОбработкаНаСервере = Новый(ИмяТипаОбъекта);

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеОтчетыИОбработкиКоманды.Ссылка КАК Ссылка,
		|	ДополнительныеОтчетыИОбработкиКоманды.Идентификатор КАК Идентификатор,
		|	ДополнительныеОтчетыИОбработкиКоманды.ГруппаПараметров КАК ГруппаПараметров
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
		|		ПО ДополнительныеОтчетыИОбработки.Ссылка = ДополнительныеОтчетыИОбработкиКоманды.Ссылка
		|ГДЕ
		|	ДополнительныеОтчетыИОбработки.ИмяОбъекта = &ИмяОбъекта
		|	И ДополнительныеОтчетыИОбработкиКоманды.НомерСтроки = &НомерСтроки");
	
	Запрос.УстановитьПараметр("ИмяОбъекта",	 ОбработкаНаСервере.Метаданные().Имя);
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		ПараметрыКоманды = Новый Структура("ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ГруппаПараметров", Выборка.Ссылка, Выборка.Идентификатор, Выборка.ГруппаПараметров);
		
		ОбработкаНаСервере.ВыполнитьКоманду(Выборка.Идентификатор, ПараметрыКоманды);
	
	КонецЕсли; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяТипаОсновногоРеквизитаФормы(Форма)
	
	// Путь к форме содержит имя объекта, по имени получим тип
	
	ТипОбъекта	= Лев(Форма.ИмяФормы, СтрНайти(Форма.ИмяФормы, ".", , , 1) - 1);
	ИмяОбъекта	= Сред(Форма.ИмяФормы, СтрДлина(ТипОбъекта) + 2, СтрНайти(Форма.ИмяФормы, ".", , , 2) - СтрДлина(ТипОбъекта) - 2);
	
	Возврат ТипОбъекта + "Объект." + ИмяОбъекта;
	
КонецФункции

#КонецОбласти
